const quiz = [
    {
      q:'تتوقع شنو مساري؟',
      options:['مسار ال WEB✨','ios','android','مالي شغل🤓'],
      answer:0
    },
    {
      q:'هل تعرف من هو الشخص الذي اخترع لغة مورس كود؟',
      options:['كتلر','هتلر','صمويل مورس','🤓اتوقع شسمه هذا مورسي مورس'],
      answer:2
    },
    {
      q:' {../.... --- .--. ./-.-- --- ..-/.... .- ...- ./..-. ..- -./.-.. . .- .-. -. .. -. --.}ورنا شطارتك و فج (ترجم) الشفرة هذي الى اللغة الانجليزية',
     
      options:['if your happy and you know clap your hands','i am too tired to write a sentence','you will never guess what i am saying','i hope you have fun learning'],
      answer:3
      
    },
    {
        q:'  A هل تستطيع ان تعترف على الحرف',
        options:['-.','-..','.','.-'],
        answer:3
      },
      {
        q:'     N و حرف M  هل تستطيع ان تعترف على الحرف',
        options:['-./--','--/-.','./-','.-/--','مخي تعقد🤪'],
        answer:1
      },
      {
        q:'     عندي لك تحدي ودي تسويه الحين طلع اسم القارة اللي دولة الكويت فيها بلغة مورس كود',
        options:['.-  ...  ..  .-','.-  ..-.  .-.  ..  -.-.  .-','.  ..-  .-.  ---  .--.  .','.-  ..-  ...  -  .-.  .-  .-..  ..  .-'],
        answer:0
      },
      {
        q:' طلع كم عدد لاعبين كرة القدم بلغة مورس كود؟',
        options:['.  .-..  .  ...-  .  -.','-.  ..  -.  .','-  .  -.'],
        answer:0
      },
      {
        q:'ما هو اختصار شفرة طلب النجدة؟',
        options:['S.O.S','C.P.S','O.I.C','C.P.S','S.M.H','C.I.O'],
        answer:0
      }
      
  ]
  
 
